Тест1/src/Catalogs/Партии/Партии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Партии</name>
  <attributes>
    <name>СтоимостьМашинВВалюте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьМашинВРублях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПартииВРублях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Машина</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАвтомобиляВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставкиПоЕвропеВВалюте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КурсВалюты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьМашиныВРублях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НакладныеРасходы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЕвро</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьАвтомобиляИтогоРуб</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьМашиныВРубляхИтог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Catalogs/Машины/Машины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Машины</name>
  <basedOn>Document.ФиксацияЗаказаМашин</basedOn>
  <attributes>
    <name>ВинКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>EnumRef.Производитель</types>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НПорядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТС</name>
    <type>
      <types>CatalogRef.ТипТС</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаТС</name>
    <type>
      <types>CatalogRef.МодельТС</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодМашины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказаниеОдометраНаНачалоЭксплуатации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПрицеп</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМашины</name>
    <type>
      <types>EnumRef.ТипМашинНаРазборке</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКабины</name>
    <type>
      <types>EnumRef.ТипыКабин</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельДвигателя</name>
    <type>
      <types>CatalogRef.МоделиДвигателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТопливнаяСистема</name>
    <type>
      <types>EnumRef.ТопливнаяСистема</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>CatalogRef.КПП</types>
    </type>
  </attributes>
  <attributes>
    <name>Редуктор</name>
    <type>
      <types>CatalogRef.Редукторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.Серии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументФиксацииЗаказаМашины</name>
    <type>
      <types>DocumentRef.ФиксацияЗаказаМашин</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.МоделиАвтомобилей</types>
    </type>
  </attributes>
  <attributes>
    <name>МашинаАгрегат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПартии</name>
    <type>
      <types>CatalogRef.Партии</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкупаемостиАвто</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОкупаемостиВМесяцах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тест1/src/Catalogs/Партии/Forms/ФормаЭлемента/Module.bsl
//Волков ИО 17.01.24 ++
&НаКлиенте
Процедура ТаблицаМашинаПриИзменении(Элемент)
	
	ТекМашина = Элементы.Таблица.ТекущиеДанные.Машина;
	ТЗСумма = ПолучитьСуммыПоМашинам(ТекМашина);
	
	Если ТЗСумма = Неопределено Тогда 
		
		Возврат;
	
	КонецЕсли;
		
	Элементы.Таблица.ТекущиеДанные.ДополнительныеРасходы = ТЗСумма.ДополнительныеРасходы;
	Элементы.Таблица.ТекущиеДанные.КурсВалюты = ТЗСумма.КурсВалютыКРублю;
	Элементы.Таблица.ТекущиеДанные.СтоимостьАвтомобиляВВалюте = ТЗСумма.СтоимостьАвтомобиляВВалюте;
	Элементы.Таблица.ТекущиеДанные.СтоимостьДоставкиПоЕвропеВВалюте = ТЗСумма.СтоимостьДоставкиПоЕвропеВВалюте;
	Элементы.Таблица.ТекущиеДанные.СтоимостьМашиныВРублях = ТЗСумма.СуммаЕвро * ТЗСумма.КурсВалютыКРублю;    
	Элементы.Таблица.ТекущиеДанные.СуммаЕвро = ТЗСумма.СуммаЕвро;   
	Элементы.Таблица.ТекущиеДанные.СтоимостьАвтомобиляИтогоРуб = ТЗСумма.СтоимостьМашиныВРублях + Объект.СтоимостьПартииВРублях;
	
КонецПроцедуры

Функция ПолучитьСуммыПоМашинам(ТекМашина)    
	
	Если Не ЗначениеЗаполнено(ТекМашина.ДокументФиксацииЗаказаМашины) Тогда 
		Сообщить("Для Машины не назначен документ Фиксации заказа машин, добавить машину невозможно!");
		Возврат Неопределено ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ФиксацияЗаказаМашин.НаименованиеМашины КАК НаименованиеМашины,
	|	ФиксацияЗаказаМашин.СтоимостьАвтоЕвро КАК СтоимостьАвтомобиляВВалюте,
	|	ФиксацияЗаказаМашин.СтоимостьДоставкиИзСтраны КАК СтоимостьДоставкиПоЕвропеВВалюте,
	|	ФиксацияЗаказаМашин.ДополнительныеРасходы КАК ДополнительныеРасходы,
	|	ФиксацияЗаказаМашин.КурсЕвроКРублю КАК КурсВалютыКРублю,
	|	ФиксацияЗаказаМашин.Статус КАК Статус,
	|	ФиксацияЗаказаМашин.СтоимостьАвтоРубли КАК СтоимостьМашиныВРублях,
	|	ФиксацияЗаказаМашин.СтоимостьДоставкиПоРоссии КАК СтоимостьДоставкиПоРоссии,
	|	ФиксацияЗаказаМашин.СуммаЕвро КАК СуммаЕвро,
	|	ФиксацияЗаказаМашин.СуммаРубли КАК СуммаРубли,
	|	ФиксацияЗаказаМашин.ФинансовыйСтатус КАК ФинансовыйСтатус
	|ИЗ
	|	Справочник.Машины КАК Машины
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФиксацияЗаказаМашин КАК ФиксацияЗаказаМашин
	|		ПО Машины.Ссылка = ФиксацияЗаказаМашин.НаименованиеМашины
	|ГДЕ
	|	Машины.Ссылка = &Машина";
	
	Запрос.УстановитьПараметр("Машина", ТекМашина); 
	РезультатЗапроса = Запрос.Выполнить();  
	Если не РезультатЗапроса.Пустой() Тогда
		Выгрузка = РезультатЗапроса.Выгрузить(); 
		
		СтруктураДанных = Новый Структура();    
		
		Для Каждого Стр из Выгрузка Цикл
			
			Машина 							 = Стр.НаименованиеМашины;
			СтоимостьАвтомоВВалюте 			 = Стр.СтоимостьАвтомобиляВВалюте;
			СтоимостьДоставкиПоЕвропеВВалюте = Стр.СтоимостьДоставкиПоЕвропеВВалюте;
			ДополнительныеРасходы 			 = Стр.ДополнительныеРасходы;
			КурсВалютыКРублю 				 = Стр.КурсВалютыКРублю;
			Статус 							 = Стр.Статус;
			СтоимостьМашиныВРублях 			 = Стр.СтоимостьМашиныВРублях;
			СтоимостьДоставкиПоРоссии 		 = Стр.СтоимостьДоставкиПоРоссии;	
			ФинансовыйСтатус  				 = Стр.ФинансовыйСтатус;
			СуммаЕвро 						 = Стр.СуммаЕвро; 
			СуммаРубли 						 = Стр.СуммаРубли; 
			
			СтруктураДанных.Вставить("НаименованиеМашины", Машина);
			СтруктураДанных.Вставить("СтоимостьАвтомобиляВВалюте", СтоимостьАвтомоВВалюте);
			СтруктураДанных.Вставить("СтоимостьДоставкиПоЕвропеВВалюте", СтоимостьДоставкиПоЕвропеВВалюте);
			СтруктураДанных.Вставить("ДополнительныеРасходы", ДополнительныеРасходы);
			СтруктураДанных.Вставить("КурсВалютыКРублю", КурсВалютыКРублю);
			СтруктураДанных.Вставить("Статус", Статус);
			СтруктураДанных.Вставить("СтоимостьМашиныВРублях", СтоимостьМашиныВРублях);
			СтруктураДанных.Вставить("СтоимостьДоставкиПоРоссии", СтоимостьДоставкиПоРоссии);
			СтруктураДанных.Вставить("ФинансовыйСтатус", ФинансовыйСтатус);
			СтруктураДанных.Вставить("СуммаЕвро", СуммаЕвро);
			СтруктураДанных.Вставить("СтоимостьАвтомобиляИтогоРуб", СуммаРубли);		
			
		КонецЦикла;	 
	КонецЕсли;
	Возврат СтруктураДанных;
	
КонецФункции

#Область ЗаполнениеТЧ_НеРаботает
//Процедура ЗаполнитьТЧПоМашине(ТекМашина)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ ПЕРВЫЕ 1
//	|	ФиксацияЗаказаМашин.НаименованиеМашины КАК НаименованиеМашины,
//	|	ФиксацияЗаказаМашин.СтоимостьАвтоЕвро КАК СтоимостьАвтомобиляВВалюте,
//	|	ФиксацияЗаказаМашин.СтоимостьДоставкиИзСтраны КАК СтоимостьДоставкиПоЕвропеВВалюте,
//	|	ФиксацияЗаказаМашин.ДополнительныеРасходы КАК ДополнительныеРасходы,
//	|	ФиксацияЗаказаМашин.КурсЕвроКРублю КАК КурсВалютыКРублю,
//	|	ФиксацияЗаказаМашин.Статус КАК Статус,
//	|	ФиксацияЗаказаМашин.СтоимостьАвтоРубли КАК СтоимостьМашиныВРублях,
//	|	ФиксацияЗаказаМашин.СтоимостьДоставкиПоРоссии КАК СтоимостьДоставкиПоРоссии,
//	|	ФиксацияЗаказаМашин.СуммаЕвро КАК ОбщаяСуммаВВалюте,
//	|	ФиксацияЗаказаМашин.СтоимостьАвтомобиляИтогоРуб КАК ОбщаяСуммаВРублях,
//	|	ФиксацияЗаказаМашин.ФинансовыйСтатус КАК ФинансовыйСтатус
//	|ИЗ
//	|	Справочник.Машины КАК Машины
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ФиксацияЗаказаМашин КАК ФиксацияЗаказаМашин
//	|		ПО Машины.Ссылка = ФиксацияЗаказаМашин.НаименованиеМашины
//	|ГДЕ
//	|	Машины.Ссылка = &Машина";
//	Запрос.УстановитьПараметр("Машина", ТекМашина); 
//	РезультатЗапроса = Запрос.Выполнить();
//	Выгрузка = РезультатЗапроса.Выгрузка[0]; 
//	
//	Для Каждого Стр Из Выгрузка Цикл
//		
//		Объект.Таблица.СтоимостьАвтомобиляВВалюте = стр.СтоимостьАвтомобиляВВалюте;
//		Объект.Таблица.СтоимостьДоставкиПоЕвропеВВалюте = стр.СтоимостьДоставкиПоЕвропеВВалюте;
//		Объект.Таблица.ДополнительныеРасходы = стр.ДополнительныеРасходы;
//		Объект.Таблица.КурсВалюты = стр.КурсВалютыКРублю;
//		Объект.Таблица.СтоимостьМашиныВРублях = стр.СтоимостьМашиныВРублях;
//		
//	КонецЦикла;
//	
//КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партии.Ссылка КАК Ссылка,
	|	ПартииТаблица.Ссылка КАК Ссылка1,
	|	ПартииТаблица.НомерСтроки КАК НомерСтроки,
	|	ПартииТаблица.Машина КАК Машина,
	|	ПартииТаблица.Коэффициент КАК Коэффициент,
	|	ПартииТаблица.СтоимостьАвтомобиляВВалюте КАК СтоимостьАвтомобиляВВалюте,
	|	ПартииТаблица.СтоимостьДоставкиПоЕвропеВВалюте КАК СтоимостьДоставкиПоЕвропеВВалюте,
	|	ПартииТаблица.ДополнительныеРасходы КАК ДополнительныеРасходы,
	|	ПартииТаблица.Валюта КАК Валюта,
	|	ПартииТаблица.КурсВалюты КАК КурсВалюты,
	|	ПартииТаблица.СтоимостьМашиныВРублях КАК СтоимостьМашиныВРублях,
	|	ПартииТаблица.НакладныеРасходы КАК НакладныеРасходы,
	|	ПартииТаблица.СуммаЕвро КАК СуммаЕвро,
	|	ПартииТаблица.СтоимостьАвтомобиляИтогоРуб КАК СтоимостьАвтомобиляИтогоРуб,
	|	ПартииТаблица.СтоимостьМашиныВРубляхИтог КАК СтоимостьМашиныВРубляхИтог
	|ПОМЕСТИТЬ ВТ_Партия
	|ИЗ
	|	Справочник.Партии.Таблица КАК ПартииТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партии КАК Партии
	|		ПО ПартииТаблица.Ссылка = Партии.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Партия.Машина КАК Машина,
	|	ВТ_Партия.СтоимостьАвтомобиляВВалюте КАК СтоимостьАвтомобиляВВалюте,
	|	ВТ_Партия.СтоимостьДоставкиПоЕвропеВВалюте КАК СтоимостьДоставкиПоЕвропеВВалюте,
	|	ВТ_Партия.ДополнительныеРасходы КАК ДополнительныеРасходы,
	|	ВТ_Партия.Валюта КАК Валюта,
	|	ВТ_Партия.КурсВалюты КАК КурсВалюты,
	|	ВТ_Партия.СтоимостьМашиныВРублях КАК СтоимостьМашиныВРублях,
	|	ВТ_Партия.НакладныеРасходы КАК НакладныеРасходы,
	|	ВТ_Партия.СуммаЕвро КАК СуммаЕвро,
	|	ВТ_Партия.СтоимостьАвтомобиляИтогоРуб КАК СтоимостьАвтомобиляИтогоРуб,
	|	ВТ_Партия.СтоимостьМашиныВРубляхИтог КАК СтоимостьМашиныВРубляхИтог
	|ИЗ
	|	ВТ_Партия КАК ВТ_Партия
	|ГДЕ
	|	ВТ_Партия.Ссылка = &Партия
	|ИТОГИ
	|	СУММА(СтоимостьАвтомобиляВВалюте),
	|	СУММА(СтоимостьДоставкиПоЕвропеВВалюте),
	|	СУММА(ДополнительныеРасходы),
	|	СУММА(СтоимостьМашиныВРублях),
	|	СУММА(НакладныеРасходы),
	|	СУММА(СуммаЕвро),
	|	СУММА(СтоимостьАвтомобиляИтогоРуб),
	|	СУММА(СтоимостьМашиныВРубляхИтог)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Партия", Объект.Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Выборка.Следующий(); 		
		
		ДопРасходы = Выборка.ДополнительныеРасходы;// 32 222
		СтоимостьАвтомобиляВВалюте = Выборка.СтоимостьАвтомобиляВВалюте;        // 44 900
		СтоимостьАвтомобиляИтогоРуб = Выборка.СтоимостьАвтомобиляИтогоРуб;       // 5 210 000	
		СтоимостьДоставкиПоЕвропеВВалюте = Выборка.СтоимостьДоставкиПоЕвропеВВалюте;  // 7 000	
		СтоимостьМашиныВРублях = Выборка.СтоимостьМашиныВРублях;            // 4 542 000	
		СтоимостьМашиныВРубляхИтог = Выборка.СтоимостьМашиныВРубляхИтог;        // 0
		СуммаЕвро = Выборка.СуммаЕвро;	                       // 84 122	
		
		Объект.СтоимостьМашинВВалюте = СтоимостьАвтомобиляВВалюте + СтоимостьДоставкиПоЕвропеВВалюте + ДопРасходы; 
		Объект.СтоимостьМашинВРублях = СтоимостьМашиныВРублях; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Записать();
	ЗаполнитьРеквизитыМашин();        
	//ЗаполнитьТЧ_КоэффициентНакладныеРасходы()
	Для каждого стр из Объект.Таблица Цикл
		Стр.Коэффициент = Стр.СтоимостьМашиныВРублях / Объект.СтоимостьМашинВРублях;	
		Стр.НакладныеРасходы = (Объект.СтоимостьПартииВРублях - Объект.СтоимостьМашинВРублях)*Стр.Коэффициент;  
		Стр.СтоимостьАвтомобиляИтогоРуб = Стр.СтоимостьМашиныВРублях + Стр.НакладныеРасходы;
		Если Стр.НакладныеРасходы <= 0 Тогда
			Стр.НакладныеРасходы = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТЧ_КоэффициентНакладныеРасходы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партии.Ссылка КАК Партии,
	|	ПартииТаблица.Ссылка КАК Ссылка1,
	|	ПартииТаблица.НомерСтроки КАК НомерСтроки,
	|	ПартииТаблица.Машина КАК Машина,
	|	ПартииТаблица.Коэффициент КАК Коэффициент,
	|	ПартииТаблица.СтоимостьАвтомобиляВВалюте КАК СтоимостьАвтомобиляВВалюте,
	|	ПартииТаблица.СтоимостьДоставкиПоЕвропеВВалюте КАК СтоимостьДоставкиПоЕвропеВВалюте,
	|	ПартииТаблица.ДополнительныеРасходы КАК ДополнительныеРасходы,
	|	ПартииТаблица.Валюта КАК Валюта,
	|	ПартииТаблица.КурсВалюты КАК КурсВалюты,
	|	ПартииТаблица.СтоимостьМашиныВРублях КАК СтоимостьМашиныВРублях,
	|	ПартииТаблица.НакладныеРасходы КАК НакладныеРасходы,
	|	ПартииТаблица.СуммаЕвро КАК СуммаЕвро,
	|	ПартииТаблица.СтоимостьАвтомобиляИтогоРуб КАК СтоимостьАвтомобиляИтогоРуб,
	|	ПартииТаблица.СтоимостьМашиныВРубляхИтог КАК СтоимостьМашиныВРубляхИтог
	|ПОМЕСТИТЬ ВТ_Партия
	|ИЗ
	|	Справочник.Партии.Таблица КАК ПартииТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партии КАК Партии
	|		ПО ПартииТаблица.Ссылка = Партии.Ссылка
	|ГДЕ
	|	Партии.Ссылка = &Партия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Партия.Машина КАК Машина,
	|	ВТ_Партия.Коэффициент КАК Коэффициент,
	|	ВТ_Партия.СтоимостьАвтомобиляВВалюте КАК СтоимостьАвтомобиляВВалюте,
	|	ВТ_Партия.СтоимостьДоставкиПоЕвропеВВалюте КАК СтоимостьДоставкиПоЕвропеВВалюте,
	|	ВТ_Партия.ДополнительныеРасходы КАК ДополнительныеРасходы,
	|	ВТ_Партия.Валюта КАК Валюта,
	|	ВТ_Партия.КурсВалюты КАК КурсВалюты,
	|	ВТ_Партия.СтоимостьМашиныВРублях КАК СтоимостьМашиныВРублях,
	|	ВТ_Партия.НакладныеРасходы КАК НакладныеРасходы,
	|	ВТ_Партия.СуммаЕвро КАК СуммаЕвро,
	|	ВТ_Партия.СтоимостьАвтомобиляИтогоРуб КАК СтоимостьАвтомобиляИтогоРуб,
	|	ВТ_Партия.СтоимостьМашиныВРубляхИтог КАК СтоимостьМашиныВРубляхИтог
	|ИЗ
	|	ВТ_Партия КАК ВТ_Партия";
	
	Запрос.УстановитьПараметр("Партия", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда  
		
		
		Выгрузка = РезультатЗапроса.Выгрузить(); 
		//СтруктураДанных = Новый Структура();    

		Для Каждого Стр из Выгрузка Цикл
			
			
			Стр.Коэффициент =  Стр.СтоимостьМашиныВРублях / Объект.СтоимостьМашинВРублях;
			//Машина 							 = Стр.Машина;
			//СтоимостьАвтомоВВалюте 			 = Стр.СтоимостьАвтомобиляВВалюте;
			//СтоимостьДоставкиПоЕвропеВВалюте = Стр.СтоимостьДоставкиПоЕвропеВВалюте;
			//ДополнительныеРасходы 			 = Стр.ДополнительныеРасходы;
			//КурсВалютыКРублю 				 = Стр.КурсВалюты;
			//Статус 							 = Стр.Статус;
			//СтоимостьМашиныВРублях 			 = Стр.СтоимостьМашиныВРублях;
			//Коэффициент = Стр.Коэффициент;  
			//СтоимостьАвтомобиляИтогВРуб		 = Стр.СтоимостьАвтомобиляИтогоРуб;
			//СтоимостьДоставкиПоРоссии 		 = Стр.СтоимостьДоставкиПоРоссии;	
			//ФинансовыйСтатус  				 = Стр.ФинансовыйСтатус;
			//СуммаЕвро 						 = Стр.СуммаЕвро; 
			//СуммаРубли 						 = Стр.СуммаРубли; 
			
			//СтруктураДанных.Вставить("НаименованиеМашины", Машина);
			//СтруктураДанных.Вставить("СтоимостьАвтомобиляВВалюте", СтоимостьАвтомоВВалюте);
			//СтруктураДанных.Вставить("СтоимостьДоставкиПоЕвропеВВалюте", СтоимостьДоставкиПоЕвропеВВалюте);
			//СтруктураДанных.Вставить("ДополнительныеРасходы", ДополнительныеРасходы);
			//СтруктураДанных.Вставить("КурсВалютыКРублю", КурсВалютыКРублю);

			//СтруктураДанных.Вставить("Статус", Статус);
			//СтруктураДанных.Вставить("СтоимостьМашиныВРублях", СтоимостьМашиныВРублях);
			//СтруктураДанных.Вставить("СтоимостьДоставкиПоРоссии", СтоимостьДоставкиПоРоссии);
			//СтруктураДанных.Вставить("ФинансовыйСтатус", ФинансовыйСтатус);
			//СтруктураДанных.Вставить("СуммаЕвро", СуммаЕвро);
			//СтруктураДанных.Вставить("СтоимостьАвтомобиляИтогоРуб", СуммаРубли);		
			
		КонецЦикла;
		
	КонецЕсли;
	Записать();
	
КонецПроцедуры	

Процедура ЗаполнитьРеквизитыМашин() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Партии.Ссылка КАК Ссылка,
	|	ПартииТаблица.Ссылка КАК Ссылка1,
	|	ПартииТаблица.НомерСтроки КАК НомерСтроки,
	|	ПартииТаблица.Машина КАК Машина,
	|	ПартииТаблица.Коэффициент КАК Коэффициент,
	|	ПартииТаблица.СтоимостьАвтомобиляВВалюте КАК СтоимостьАвтомобиляВВалюте,
	|	ПартииТаблица.СтоимостьДоставкиПоЕвропеВВалюте КАК СтоимостьДоставкиПоЕвропеВВалюте,
	|	ПартииТаблица.ДополнительныеРасходы КАК ДополнительныеРасходы,
	|	ПартииТаблица.Валюта КАК Валюта,
	|	ПартииТаблица.КурсВалюты КАК КурсВалюты,
	|	ПартииТаблица.СтоимостьМашиныВРублях КАК СтоимостьМашиныВРублях,
	|	ПартииТаблица.НакладныеРасходы КАК НакладныеРасходы,
	|	ПартииТаблица.СуммаЕвро КАК СуммаЕвро,
	|	ПартииТаблица.СтоимостьАвтомобиляИтогоРуб КАК СтоимостьАвтомобиляИтогоРуб,
	|	ПартииТаблица.СтоимостьМашиныВРубляхИтог КАК СтоимостьМашиныВРубляхИтог
	|ПОМЕСТИТЬ ВТ_Партия
	|ИЗ
	|	Справочник.Партии.Таблица КАК ПартииТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партии КАК Партии
	|		ПО ПартииТаблица.Ссылка = Партии.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Партия.Машина КАК Машина,
	|	ВТ_Партия.СтоимостьАвтомобиляВВалюте КАК СтоимостьАвтомобиляВВалюте,
	|	ВТ_Партия.СтоимостьДоставкиПоЕвропеВВалюте КАК СтоимостьДоставкиПоЕвропеВВалюте,
	|	ВТ_Партия.ДополнительныеРасходы КАК ДополнительныеРасходы,
	|	ВТ_Партия.Валюта КАК Валюта,
	|	ВТ_Партия.КурсВалюты КАК КурсВалюты,
	|	ВТ_Партия.СтоимостьМашиныВРублях КАК СтоимостьМашиныВРублях,
	|	ВТ_Партия.НакладныеРасходы КАК НакладныеРасходы,
	|	ВТ_Партия.СуммаЕвро КАК СуммаЕвро,
	|	ВТ_Партия.СтоимостьАвтомобиляИтогоРуб КАК СтоимостьАвтомобиляИтогоРуб,
	|	ВТ_Партия.СтоимостьМашиныВРубляхИтог КАК СтоимостьМашиныВРубляхИтог
	|ИЗ
	|	ВТ_Партия КАК ВТ_Партия
	|ГДЕ
	|	ВТ_Партия.Ссылка = &Партия
	|ИТОГИ
	|	СУММА(СтоимостьАвтомобиляВВалюте),
	|	СУММА(СтоимостьДоставкиПоЕвропеВВалюте),
	|	СУММА(ДополнительныеРасходы),
	|	СУММА(СтоимостьМашиныВРублях),
	|	СУММА(НакладныеРасходы),
	|	СУММА(СуммаЕвро),
	|	СУММА(СтоимостьАвтомобиляИтогоРуб),
	|	СУММА(СтоимостьМашиныВРубляхИтог)
	|ПО
	|	ОБЩИЕ";
	
	Запрос.УстановитьПараметр("Партия", Объект.Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда  
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Выборка.Следующий(); 		
		
		ДопРасходы = Выборка.ДополнительныеРасходы;// 32 222
		СтоимостьАвтомобиляВВалюте = Выборка.СтоимостьАвтомобиляВВалюте;        // 44 900
		СтоимостьАвтомобиляИтогоРуб = Выборка.СтоимостьАвтомобиляИтогоРуб;       // 5 210 000	
		СтоимостьДоставкиПоЕвропеВВалюте = Выборка.СтоимостьДоставкиПоЕвропеВВалюте;  // 7 000	
		СтоимостьМашиныВРублях = Выборка.СтоимостьМашиныВРублях;            // 4 542 000	
		СтоимостьМашиныВРубляхИтог = Выборка.СтоимостьМашиныВРубляхИтог;        // 0
		СуммаЕвро = Выборка.СуммаЕвро;	                       // 84 122	
		
		Объект.СтоимостьМашинВВалюте = СтоимостьАвтомобиляВВалюте + СтоимостьДоставкиПоЕвропеВВалюте + ДопРасходы;
		Объект.СтоимостьМашинВРублях = СтоимостьМашиныВРублях;
		
	КонецЕсли;
	
	//Заполняем накладные расходы 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Расходы.Ссылка КАК СсылкаРасход,
	|	Расходы.Сумма КАК СуммаПоПартии
	|ИЗ
	|	Документ.Расходы КАК Расходы
	|ГДЕ
	|	Расходы.Партия = &Партия
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ"; 
	
	Запрос.УстановитьПараметр("Партия", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Выборка.Следующий();
		
		Объект.СтоимостьПартииВРублях =  Выборка.СуммаПоПартии;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры
//Волков ИО 17.01.24 --
